return {
  'nvimdev/dashboard-nvim',
  event = 'VimEnter',
  config = function()
    vim.api.nvim_set_hl(0, "DashboardHeader", { fg = "#00FF00", bold = true })
    local date_str = "Today is " .. os.date("%A, %B %d, %Y")

    require('dashboard').setup {
       config = {

            footer = function()
              local stats = require("lazy").stats()
              return { "⚡ Neovim loaded " .. stats.count .. " plugins in " .. stats.startuptime .. "ms" }
            end,
            header = {
	[[                                                                       ]],
	[[                                                                     ]],
	[[       ████ ██████           █████      ██                     ]],
	[[      ███████████             █████                             ]],
	[[      █████████ ███████████████████ ███   ███████████   ]],
	[[     █████████  ███    █████████████ █████ ██████████████   ]],
	[[    █████████ ██████████ █████████ █████ █████ ████ █████   ]],
	[[  ███████████ ███    ███ █████████ █████ █████ ████ █████  ]],
	[[ ██████  █████████████████████ ████ █████ █████ ████ ██████ ]],
	[[                                                                       ]],
                  string.rep(" ", 1) .. "📅 " .. date_str,  
                }
            }
    }
  end,
  dependencies = { {'nvim-tree/nvim-web-devicons'}}
}
